Revit 2026 API

# ExportUtilsGetGBXMLDocumentId Method

---

Retrieves the GUID representing this document in exported gbXML files.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Guid GetGBXMLDocumentId(
	Document document
)
```
```vb
Public Shared Function GetGBXMLDocumentId (
	document As Document
) As Guid
```
```cpp
public:
static Guid GetGBXMLDocumentId(
	Document^ document
)
```
```fsharp
static member GetGBXMLDocumentId :
        document : Document -> Guid
```

#### Parameters

document Document
     The document.

#### Return Value

Guid The value of the GUID representing this document in gbXML export.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This id can be used to cross-reference different gbXML exports from the same document.

#### Reference

ExportUtils Class

Autodesk.Revit.DB Namespace